Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །སུ་དག་ཀློག་ཅིང་སུ་དག་ལུང་ནོད་པ། །དེ་དག་ལ་ནི་བདག་ཀྱང་བསྙེན་བཀུར་བགྱིད།
en: Who recite it and teach it.

source: །དེ་དག་ཐམས་ཅད་མི་ཡི་མཆོག་ཏུ་འགྱུར།
en: They all become supreme men. {149}

source: །བདག་ནི་བླ་ན་མེད་པའི་ལས་དེ་ཡིས།
en: “ ‘Because of that unsurpassable karma

source: །སངས་རྒྱས་འཇིག་རྟེན་མགོན་པོ་མང་པོ་མཐོང་། །རྒྱལ་བའི་བསྟན་པ་ལ་ཡང་རབ་བྱུང་སྟེ།
en: I saw many buddhas, many lords of the world. I entered into homelessness in the teachings of those jinas

source: །རྟག་ཏུ་ཆོས་སྨྲ་བ་ནི་མཁས་པར་གྱུར།
en: And I always became a wise dharmabhāṇaka. {150}

source: །སྦྱངས་པ་ལ་ཡང་རྟག་ཏུ་བདག་བརྩོན་ཏེ།
en: “ ‘I was always engaged in the discipline of a mendicant.

source: །བས་མཐའ་དགོན་པ་ལ་ཡང་ཁོར་མོར་གནས།
en: I always remained in the solitude of forests.

source: །ཁ་ཟས་ཕྱིར་ནི་ཚུལ་འཆོས་མི་བགྱིད་དེ།
en: I never gave the appearance of spirituality in order to obtain food.

source: །ངན་ངོན་ཙམ་དག་གིས་ཀྱང་ཆོག་ཤེས་གྱུར།
en: I was content with whatever I obtained. {151}

source: །བདག་ནི་རྟག་ཏུ་ཕྲག་དོག་མ་མཆིས་ཏེ།
en: “ ‘At all times I was free of envy.

source: །བདག་ནི་ཁྱིམ་ལའང་ཆགས་པར་མི་འགྱུར་རོ།
en: I had no attachment to a family.

source: །ཁྱིམ་ལ་ཆགས་པ་དག་ནི་ཕྲག་དོག་སྐྱེ།
en: Attachment to family causes envy.

source: །ཕྲག་དོག་མ་མཆིས་ནགས་དགོན་དགའ་བར་བགྱིད།
en: Without envy I remained in the pleasant forests. {152}

source: །བདག་ནི་རྟག་ཏུ་བྱམས་ལ་གནས་པར་གྱུར།
en: “ ‘At all times I had loving-kindness.

source: །གཤེ་ཞིང་སྡིགས་ཀྱང་ཁྲོ་བ་མི་སྐྱེད་དེ།
en: When I was abused I did not become angry.

source: །བྱམས་པ་ལ་ཡང་གནས་པ་དེས་པ་ཡི།
en: As I was always kind, the garland of fame

source: །སྙན་པའི་ཕྲེང་བ་ཕྱོགས་བཞིར་རབ་ཏུ་མཆེད།
en: Of my compassion spread in the four directions. {153}

source: །རྟག་ཏུ་ཆོག་ཤེས་འདོད་པ་ཉུང་བར་གྱུར།
en: “ ‘I was always content, with few desires.

source: །དགོན་པར་གནས་ཤིང་སྦྱངས་པའི་ཡོན་ཏན་བརྩོན།
en: I was dedicated to mendicancy in solitary places.

source: །བསོད་སྙོམས་ལེན་པ་དག་ཀྱང་མི་གཏོང་སྟེ།
en: I never abandoned begging for alms.

source: །སྦྱངས་པ་ལ་ཡང་ཡི་དམ་བརྟན་པར་གྱུར།
en: I remained unwaveringly committed to mendicancy. {154}

source: །རྟག་ཏུ་དང་བར་བཅས་ཤིང་དད་པར་གྱུར།
en: “ ‘I always had faith and belief.

source: །ཁོར་མོར་སངས་རྒྱས་བསྟན་ལ་དད་པ་མང་།
en: I always had great belief in the Buddha’s teaching.

source: །དད་པ་མང་བའི་ཕན་ཡོན་འདི་ལགས་ཏེ།
en: I obtained many benefits from having belief.

source: །བྱད་བཞིན་བཟང་ཞིང་དབང་པོ་མ་ཉམས་གྱུར།
en: I became attractive with faultless faculties. {155}

source: །གང་དག་འཆད་པ་དེ་ལ་བདག་གནས་ཏེ།
en: “ ‘I practiced whatever I taught.

source: །བདག་ནི་རྟག་ཏུ་ནན་ཏན་སྙིང་པོར་བགྱིད།
en: I always valued practice above all else.

source: །ནན་ཏན་སྙིང་པོར་བགྱིད་ལ་ལྷ་ཀླུ་ཡང་།
en: As I valued practice above all else,

source: །རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་རི་མོར་བགྱིད།
en: Devas and nāgas believed in me and honored me. {156}

source: །ཡོན་ཏན་ཇི་སྙེད་བརྗོད་པ་འདི་དག་དང་། །གཞན་ཡང་རྣམ་པ་དུ་མ་མང་པོ་ཡོད།
en: “ ‘There are also numerous other qualities, Other than these that I have described. They should always be trained in by the wise ones

source: །སངས་རྒྱས་བྱང་ཆུབ་རྟོགས་པར་སུ་འདོད་པ། །མཁས་པ་འདི་དག་རྟག་ཏུ་བསླབ་པར་བགྱི།
en: Who wish for the enlightenment of buddhahood. {157}

source: །འདི་བས་ཆེས་མང་དཀའ་བ་སྤྱད་པ་ནི།
en: “ ‘I remember the greatest number of hardships

source: །སྔོན་གྱི་བསྐལ་པ་དུ་མར་མང་སྤྱད་དྲན།
en: That I practiced through numerous eons,

source: །ད་ལྟར་དེ་དག་བརྗོད་པར་མི་ནུས་ཀྱིས།
en: So numerous I am unable to describe them.

source: །བདེ་བར་གཤེགས་པའི་དྲུང་དུ་ད་མཆིའོ།
en: I will now go into the presence of the Sugata.’ {158}

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་རྣོ་མཁས་དེས།
en: “That wise bodhisattva with sharp wisdom

source: །དེ་ཡི་མོད་ལ་མངོན་ཤེས་ལྔ་ཐོབ་ནས།
en: At that moment attained the five higher cognitions.

source: །དེ་ཡང་སྲོག་ཆགས་བྱེ་བ་བརྒྱད་ཅུ་དང་། །རྫུ་འཕྲུལ་གྱིས་ནི་རྒྱལ་བའི་དྲུང་དུ་སོང་།
en: Through miraculous power he came before the Jina, Accompanied by eight hundred million beings. {159}

source: །བརྟན་པའི་སྟོབས་ཀྱང་མཆོག་ཏུ་དགའ་རངས་ནས།
en: “Dṛḍhabala was extremely pleased,

source: །དེ་ཚེ་བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུ་དང་། །དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་ཉེར་ལྷགས་ཏེ།
en: And, accompanied by one billion six hundred million beings, He came into the presence of the Buddha,

source: །ཞབས་ལ་ཕྱག་འཚལ་ནས་ནི་སྤྱན་སྔར་འདུག །རྒྱལ་པོ་དེ་ཡི་ལྷག་པའི་བསམ་མཁྱེན་ནས།
en: Bowed down to his feet, and sat before him. {160} “Knowing the aspiration of that king,

source: །རྐང་གཉིས་དབང་པོས་ཏིང་འཛིན་འདི་བཤད་དེ།
en: The Lord of humans taught this samādhi.

source: །རྒྱལ་པོ་དེས་ཀྱང་ཏིང་འཛིན་འདི་ཐོས་ནས།
en: When the king had heard that samādhi

source: །རྒྱལ་སྲིད་བཏང་སྟེ་མ་ཆགས་རབ་ཏུ་བྱུང་།
en: He renounced his kingdom and entered homelessness. {161}

source: །རབ་ཏུ་བྱུང་ནས་ཏིང་འཛིན་འདི་ལ་སྒོམ།
en: “Homeless, he meditated on this samādhi,

source: །ཀློག་ཅིང་འཆད་དེ་རབ་ཏུ་སྟོན་པར་བྱེད།
en: And he recited it and taught it.

source: །བསྐལ་པ་དྲུག་ཅུ་འདས་པའི་འོག་ཏུ་དེ།
en: After sixty eons had passed

source: །པད་མ་བླ་མ་ཞེས་བྱ་རྒྱལ་བར་གྱུར།
en: He became a jina named Padmottara. {162} “The one billion six hundred million beings

source: །རྒྱལ་པོ་ལྷན་ཅིག་རྒྱལ་བའི་དྲུང་འོངས་པ། །བྱེ་བ་བརྒྱ་ཕྲག་དྲུག་ཅུ་མི་ཉུང་བ།
en: Who had come with the king into the presence of the Jina

source: །དེ་དག་ཀྱང་ནི་ཏིང་འཛིན་འདི་ཐོས་ནས།
en: Also heard this samādhi,

source: །དེ་ཚེ་དགའ་ཞིང་མགུ་བས་རབ་ཏུ་བྱུང་།
en: And with the highest joy they entered homelessness. {163}

source: །དེ་དག་རབ་ཏུ་བྱུང་ནས་ཏིང་འཛིན་འདི།
en: “Homeless, they possessed this samādhi,

source: །བཟུང་ཞིང་བཀླགས་ཏེ་རབ་ཏུ་སྟོན་པར་བྱེད།
en: And recited it and taught it.

source: །བསྐལ་པ་ཁྲག་ཁྲིག་དྲུག་ཅུ་འདས་ནས་ནི།
en: After six trillion eons had passed

source: །བསྐལ་པ་གཅིག་ལ་བྱང་ཆུབ་མཆོག་རེག་སྟེ།
en: They all reached supreme enlightenment in the same eon. {164}

source: །མཚན་ནི་ཡེ་ཤེས་བླ་མ་མཐའ་ཡས་པ།
en: “They all had the name Ananta­jñānanottara.

source: །ལྷ་མིས་མཆོད་པའི་སངས་རྒྱས་རྣམས་སུ་གྱུར།
en: They were buddhas to whom devas and humans made offerings.

source: །དེ་ལ་རྐང་གཉིས་གཙོ་བོ་རེ་རེས་ཀྱང་། །སེམས་ཅན་གང་གཱའི་བྱེ་སྙེད་གྲོལ་བར་བྱས།
en: Each of those supreme humans liberated as many beings

source: །བྱང་ཆུབ་སྤྱོད་པ་མཆོག་འདི་སྤྱོད་པ་ན།
en: As there are grains of sand in the Ganges. {165}

source: །ང་ནི་རྒྱལ་པོ་དཔལ་གྱི་སྟོབས་སུ་གྱུར།
en: “I was King Śirībala. The practitioners of this supreme bodhisattva conduct,

source: །ང་ཡི་བུ་དག་ལྔ་བརྒྱ་ཡོད་པ་ཡང་།
en: Those who were my five hundred sons,

source: །རྗེས་སུ་ཆོས་རྣམས་སྐྱོང་བ་འདི་དག་ཡིན།
en: Are these guardians of the Dharma. {166}

source: །དེ་ཚེ་གང་སུ་ང་ཡི་མར་གྱུར་པ།
en: “The one who was my mother

source: །དེ་ནི་ལྷ་མོ་སྒྱུ་འཕྲུལ་ཉིད་ཡིན་ཏེ།
en: Was Māyādevī in this time.

source: །བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཞིར་ཚང་བ་ཡི། །ང་ཡི་བུ་མོ་དེ་ཀུན་མྱ་ངན་འདས།
en: My four hundred billion daughters All entered nirvāṇa. {166b}

source: །སྟོབས་བརྟན་ཞེས་བྱ་རྒྱལ་པོ་གང་བྱུང་བ།
en: “The king who was named Dṛḍhabala,

source: །རབ་ཏུ་མཛོད་མང་འཁོར་ལོས་སྒྱུར་བའི་མཆོག །དེ་ཚེ་རྒྱལ་པོ་ཟས་གཙང་དེ་ཡིན་ཏེ།
en: The powerful cakravartin with many treasures, Became King Śuddhodana in this age,

source: །དེ་དང་དེར་ཡང་ང་ཡི་ཡབ་ཏུ་གྱུར།
en: And has been my father in various lifetimes. {166c}

source: །དེ་ལྟར་ངས་ནི་བསྐལ་པ་བྱེ་སྟོང་དུ།
en: “Thus have I for ten billion eons

source: །ལེ་ལོ་མེད་ཅིང་བརྩོན་འགྲུས་བརྩམས་པ་ཡིས།
en: Exercised diligence that is free of laziness. The pure yearning for this samādhi

source: །བྱང་ཆུབ་མཆོག་འདི་ཡང་དག་སྒྲུབ་པ་ན།
en: Brings the accomplishment of supreme enlightenment. {167}

source: །ཏིང་འཛིན་ཡོངས་སུ་ཚོལ་བ་རྣམ་པར་དག །གཞོན་ནུ་དེ་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་གང་།
en: “Therefore, young man, those bodhisattvas

source: །ཏིང་འཛིན་འདི་ལ་སྒོམ་པར་འདོད་པ་དག །བརྩོན་འགྲུས་བརྩམས་ཤིང་སྲོག་ལ་མི་ལྟ་བར།
en: Who wish to meditate on this samādhi Should exercise diligence, regardless of risks to their lives,

source: །གཞོན་ནུ་རྟག་པར་ང་ཡི་རྗེས་སུ་སློབས།
en: And always follow, young man, my example.” {168}

source: །སངས་རྒྱས་མང་པོའི་ཏིང་ངེ་འཛིན་གྱི་སྒོའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་བདུན་པའོ།། །།དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Conclusion of the seventeenth chapter, “The Entranceway to the Samādhi That Is Taught by Many Buddhas.”

source: །གཞོན་ནུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཏིང་ངེ་འཛིན་འདི་འཛིན་པ་དང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་འཆང་བ་དང་ཀློག་པ་དང་རབ་ཏུ་འདོན་པ་དང་ལུང་ནོད་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་གཞན་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ལ་ཡོན་ཏན་གྱི་ཕན་ཡོན་བཞིར་རིག་པར་བྱ་སྟེ།
en: The Entrustment of the Samādhi Chapter 18 The Bhagavān said to the youth Candraprabha, “Young man, in that way know that there are four beneficial qualities possessed by bodhisattva mahāsattvas who obtain this samādhi, understand it, preserve it, recite it to others, promote it, proclaim it, chant it, and make it widely known to others.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What are those four beneficial qualities?

source: བསོད་ནམས་ཟིལ་གྱིས་མི་ནོན་པར་འགྱུར། ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཀྱིས་མི་རྫི་བར་འགྱུར། ཡེ་ཤེས་དཔག་ཏུ་མེད་པར་འགྱུར། སྤོབས་པ་མཐའ་ཡས་པར་འགྱུར་ཏེ།
en: They will be unsurpassable in merit, they will be undefeatable by opponents, they will have unlimited wisdom, and they will have unending confidence of speech.

source: གཞོན་ནུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་འཛིན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་འཆང་བ་དང་ཀློག་པ་དང་རབ་ཏུ་འདོན་པ་དང་ལུང་ནོད་པ་དང་ཁ་ཏོན་བྱེད་པ་དང་གཞན་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་ལ་ཡོན་ཏན་གྱི་ཕན་ཡོན་འདི་བཞི་ཡོད་པར་རིག་པར་བྱའོ།
en: Young man, you should know that bodhisattva mahāsattvas who obtain this samādhi, study it, keep it, read it out loud, disseminate it, teach it, chant it, and make it widely known to others will possess these four beneficial qualities.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །སངས་རྒྱས་ཀུན་གྱི་སྤྱོད་ཡུལ་བ། །ཏིང་འཛིན་ཞི་བ་འདི་བཟུང་ན།
en: The Bhagavān then recited these verses:

source: །རྟག་པའི་དུས་སུ་བསོད་ནམས་ཀྱང་། །ཤིན་ཏུ་ཟིལ་གྱིས་མ་ནོན་འགྱུར།
en: “Throughout time they will be Unsurpassable in merit

source: །བྱང་ཆུབ་སྤྱོད་པ་བྱེ་བྲག་འཕགས།
en: Through attaining this samādhi of peace.

source: །མཆོག་ཏུ་དག་པ་སྤྱོད་པ་ན།
en: That is the range of activity of all the buddhas. {1}

source: །དཔའ་བོ་རྟག་པའི་དུས་སུ་ཡང་།
en: “Throughout time these heroes

source: །བསོད་ནམས་དག་གིས་བསྲུང་བར་འགྱུར།
en: Will be protected by merit, Practicing supreme, pure, Unique bodhisattva conduct. {2}

source: །དེ་ལ་ཕས་ཀྱི་རྒོལ་བ་དག །སུ་ཡང་འཚེ་བར་ཡོང་མི་བྱེད།
en: “There will be no adversary Whatsoever who can harm them.

source: །རྟག་པའི་དུས་སུ་སངས་རྒྱས་ཀྱིས། །ཡོངས་སུ་གཟུང་བར་འགྱུར་བ་ཡིན།
en: They will, throughout time, Be in the care of the buddhas. {3}

source: །རྟག་པའི་དུས་སུ་ཡེ་ཤེས་ཀྱང་།
en: “Throughout time their wisdom

source: །དཔག་ཏུ་མེད་པར་འགྱུར་བ་ཡིན། །ཞི་བའི་རྟེན་འདི་འཛིན་པ་ནི།
en: Will be immeasurable.

source: །སྤོབས་པ་དག་ཀྱང་མཐའ་ཡས་འགྱུར།
en: Their confidence will be eternal

source: །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་རབ་བཟུང་ན།
en: Through their possessing this state of peace. {4}

source: །རྟག་ཏུ་བསོད་ནམས་ཕུང་པོ་ཟིལ་མི་ནོན།
en: “They will have an eternally unsurpassable accumulation of merit.

source: །བྱང་ཆུབ་སྤྱད་པ་དམ་པ་སྤྱོད་པ་ན།
en: They will have most excellent bodhisattva conduct.

source: །ཕས་ཀྱི་རྒོལ་བ་མེད་ཅིང་མི་ཚུགས་འགྱུར།
en: They will not be attacked by adversaries, Having come into possession of this samādhi of supreme peace. {5}

source: །དེ་ཡི་ཡེ་ཤེས་ཡངས་ཤིང་རྣོ་བར་འགྱུར། །དེ་བཞིན་སྤོབས་པ་དག་ཀྱང་མཐའ་ཡས་འགྱུར།
en: “They will have vast and sharp wisdom

source: །མིག་ཀྱང་དག་འགྱུར་རྟག་ཏུ་མཁས་པ་དེ།
en: And thus will have eternal confidence and pure sight. Those wise ones will always have

source: །དྲན་པའི་སྟོབས་དང་གཟུངས་ཀྱི་སྟོབས་ཀྱང་འབྱུང་།
en: The power of memory and the power of retention. {6}

source: །དོན་གྱི་ཚིག་རྣམས་རབ་ཏུ་སྟོན་བྱེད་ན།
en: “The meaningful words that they teach

source: །མཁས་པ་དག་གི་ཤིན་ཏུ་ཡིད་འོང་འགྱུར། །ཏིང་འཛིན་ཞི་མཆོག་འདི་ནི་རབ་བཤད་ན།
en: Will be most beautiful to the minds of the wise.

source: །ཤེས་རབ་ལྡན་པ་སྐྱེ་བོ་མང་པོས་རིག །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་རབ་བཟུང་ན།
en: Many beings with wisdom will know This supreme peaceful samādhi that is taught. {7}

source: །ཆོས་གོས་དམ་པ་མཆོག་དང་མལ་ཆ་དང་། །མགྲོན་དུ་གཉེར་དང་བཟའ་ཞིང་བཅའ་བའང་རྙེད།
en: “They will obtain perfect, excellent Dharma robes, Bedding, invitations, and hard and soft food. The ones who possess this supreme samādhi of peace

source: །ཤིན་ཏུ་གཞོན་ཞིང་བལྟ་ན་སྡུག་པར་འགྱུར། །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་ཚོལ་བ་ན།
en: Will be very youthful and handsome. {8}

source: །སངས་རྒྱས་འཇིག་རྟེན་མགོན་པོ་མང་པོ་མཐོང་།
en: “They will see many buddhas, lords of worlds,

source: །འདྲེན་པ་དག་ལ་མཚུངས་མེད་མཆོད་པ་བྱེད། །དེ་ལ་བར་ཆད་དག་ཀྱང་འབྱུང་མི་འགྱུར། །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་རབ་བཟུང་ན།
en: And make unequaled offerings to those guides. In seeking this supreme samādhi of peace They will encounter no impediment. {9} “They will be in the presence of the lords of worlds

source: །སེམས་དགའ་ཚིགས་བཅད་སྙན་པ་བརྒྱ་དག་གིས།
en: And made happy by hundreds of beautiful verses.

source: །འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་བསྟོད་འགྱུར་ཏེ།
en: Having gained this supreme samādhi of peace

source: །དེ་ནི་ཉམས་པར་ནམ་ཡང་ཡོང་མི་འགྱུར། །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་རབ་བཟུང་ན།
en: They will never experience decline. {10}

source: །དེ་ཡི་མདུན་དུ་འཇིག་རྟེན་མགོན་པོ་ནི།
en: “A Lord of the World will be present before them

source: །མཚན་དང་དཔེ་བྱད་མཛེས་པའི་སྐུ་བཞུགས་ཏེ།
en: With the beautiful primary and secondary signs of the body.

source: །དེ་ཡི་ཡེ་ཤེས་ཉམས་པར་ཡོང་མི་འགྱུར། །ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་རབ་བཟུང་ན།
en: Having gained this supreme samādhi of peace There will be no decline in their wisdom. {11}

source: །ནམ་ཡང་ཞུམ་པའི་སེམས་སུ་མི་འགྱུར་ཏེ།
en: “They will never be disheartened.

source: །རྟག་ཏུ་ཕྱུག་ཅིང་དབུལ་པོ་མ་ཡིན་འགྱུར། །སེམས་ཀྱང་འཛིན་ཅིང་ཆགས་པར་ཡོང་མི་འགྱུར།
en: They will always be wealthy and never poor.

source: །མི་ཁོམ་པར་ཡང་གནས་པར་མི་འགྱུར་ཏེ།
en: “They will never have an unfavorable existence.

source: །ས་བདག་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར།
en: They will be world rulers, cakravartin kings. Having gained this supreme samādhi of peace

source: །དེ་ཡི་རྒྱལ་སྲིད་རྟག་ཏུ་བདེ་བར་འོང་།
en: Their kingdoms will always be happy. {13} “They will have vast wisdom free of uncertainty

source: །བསྐལ་པ་བརྒྱར་ནི་བཤད་ཀྱང་མི་ཟད་དེ། །ཡེ་ཤེས་ཡངས་པ་དེ་ལ་ཐེ་ཚོམ་མེད།
en: Through unceasing teachings for hundreds of eons.

source: །ཏིང་འཛིན་ཞི་བའི་ས་འདི་ཐོས་ནས་ནི།
en: Having heard this samādhi, this level of peace,

source: །བརྟན་པ་ཇི་ལྟར་བསྟན་པ་དེ་བཞིན་གནས།
en: Constant, they will follow whatever has been taught. {14}

source: །བསྐལ་པ་བྱེ་བ་མཐའ་ཡས་དཔག་མེད་དུ། །སྟོབས་བཅུས་དེ་ཡི་ཕན་ཡོན་བརྗོད་ན་ཡང་།
en: “Though one were to describe the benefits of the ten strengths Throughout countless, endless millions of eons,

source: །ཆ་ཙམ་དུ་ནི་ཡོངས་སུ་བརྗོད་མི་འགྱུར།
en: One would not have spoken of even a fraction of them.

source: །རྒྱ་མཚོ་ལས་ནི་ཆུ་ཐིགས་བླངས་པ་བཞིན།
en: It would be like taking a drop of water from the ocean.” {15}

source: །དེ་ཚེ་གཞོན་ནུ་དེ་ཡང་རབ་དགའ་བས།
en: At that time the young man, with great joy,

source: །ལངས་ནས་རབ་ཏུ་ཐལ་སྦྱར་ཕྱག་འཚལ་ཏེ།
en: Stood up and paid homage with his palms together.

source: །མགུ་རངས་སྟོབས་བཅུ་ཡི་ནི་མངོན་སུམ་འདུག །ཚིག་རབ་མཆོག་གིས་ཆེད་དུ་རྗོད་པ་བརྗོད།
en: Joyfully standing before the one with the ten strengths He uttered these inspired words: {16} “Inconceivable great hero,

source: །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ།
en: Lord of the World, illuminator, These benefits have been taught to me

source: །མི་གཙོས་འདི་དག་ཇི་ཙམ་དུ།
en: By you, the Lord of humans. {17}

source: །ཕན་ཡོན་ལེགས་པར་རབ་བཤད་པ།
en: “Compassionate one who wishes to bring benefit,

source: །དཔའ་བོ་ཆེན་པོ་བསམ་མི་ཁྱབ།
en: Great hero, pray tell me,

source: །ཕྱི་མའི་དུས་ན་སུ་དག་ནི།
en: Who, in the future,

source: །མདོ་སྡེ་འདི་ལ་ཉན་པར་འགྱུར། །ཕན་པར་དགོངས་ཤིང་ཐུགས་བརྩེ་བ། །དཔའ་བོ་ཆེན་པོ་བདག་ལ་གསུངས།
en: Will listen to this samādhi?” {18}

source: །ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་ཀྱིས།
en: The one with a voice like the avadavat’s song,

source: །སྟོན་པས་དེ་ལ་བཤད་མཛད་དེ།
en: The Teacher who had taught this to him,

source: །བཅོམ་ལྡན་ཆགས་མེད་ཡེ་ཤེས་ཅན།
en: The Bhagavān, who had unimpeded wisdom,

source: །ཚིག་ཀྱང་འདི་སྐད་རབ་ཏུ་གསུང་།
en: Answered him with these words: {19} “Listen, young man, and I will explain

source: །སུ་དག་ཆོས་ཀྱི་རྗེས་སློབ་ཅིང་།
en: That which is the highest practice. Those who follow the Dharma

source: །མདོ་སྡེ་འདི་ནི་ཉན་འགྱུར་བ། །ནན་ཏན་བླ་ན་མེད་པ་ཡང་། །གཞོན་ནུ་བཤད་ཀྱིས་མཉན་པར་གྱིས།
en: Will be the ones who listens to this sūtra. {20}

source: །སངས་རྒྱས་ཡེ་ཤེས་རབ་ཚོལ་བས། །མི་དབང་དག་ལ་མཆོད་བྱེད་ཅིང་།
en: “They will make offerings to the lords of humans; They will seek the wisdom of buddhahood.

source: །བྱམས་པའི་སེམས་ལ་སྙེན་བྱེད་པ།
en: Developing a loving mind,

source: །མདོ་སྡེ་འདི་ནི་ཉན་པར་འགྱུར།
en: They will listen to this sūtra. {21}

source: །སྦྱངས་པའི་ཡོན་ཏན་ཡོ་བྱད་བསྙུངས།
en: “Those who have the qualities of mendicancy

source: །ཡོན་ཏན་མཆོག་ལ་བསྙེན་བྱས་ཤིང་།
en: And the qualities of austerity,

source: །ནན་ཏན་ལ་ཡང་གནས་ནས་སུ། །མདོ་སྡེ་འདི་ནི་ཉན་པར་འགྱུར།
en: And who maintain this practice, Will be ones who listen to this sūtra. {22} “They will not listen to this sūtra When it is in the hands of those whose acts are evil, Nor of those who have lost their correct conduct

source: །འཇིག་རྟེན་མགོན་པོའི་བསྟན་པ་ལ། །གང་གིས་ཚུལ་ཁྲིམས་བཤིག་པ་དང་། །སྡིག་པ་བྱེད་པའི་ལག་ནས་ནི།
en: Regarding the teaching of the lords of worlds. {23}

source: །མདོ་སྡེ་འདི་ཡང་ཐོས་མི་འགྱུར།
en: “They will hear it when in the hands

source: །དཔའ་བོ་ཚངས་པར་སྤྱོད་པ་དང་། །གང་གི་སེམས་ཀྱང་མི་བརྐམ་ཞིང་།
en: Of the celibates, the heroes, Those who have a mind free of craving

source: །སངས་རྒྱས་དག་གིས་བྱིན་བརླབས་པ།
en: And who have been consecrated by the buddhas. {24} “In future times they will hear

source: །དེ་དག་ལག་ནས་ཐོས་པར་འགྱུར།
en: This sūtra when it is in the hands Of those who have served the buddhas,

source: །གང་གིས་སྔོན་གྱི་སངས་རྒྱས་དག །འཇིག་རྟེན་མགོན་པོ་རི་མོར་བྱས། །དེ་དག་ལ་གནས་མདོ་སྡེ་འདི། །ཕྱི་མའི་དུས་ན་ཐོས་པར་འགྱུར།
en: The lords of the world, in the past. {25}

source: །གང་དག་ཚེ་རབས་སྔ་མ་ལ།
en: “Those who in previous lifetimes

source: །མུ་སྟེགས་ཅན་དུ་གྱུར་པ་ནི།
en: Have been tīrthikas

source: །དེ་དག་མདོ་སྡེ་འདི་ཐོས་ན། །ཡིད་ནི་དགའ་ཞིང་བདེར་མི་འགྱུར།
en: Will experience no joy When they hear this sūtra. {26} “Those who have entered homelessness

source: །ང་ཡི་བསྟན་པ་འདི་ལ་ནི། །འཚོ་བ་འདོད་ཕྱིར་རབ་བྱུང་ནས།
en: In my teaching in order to have a livelihood

source: །རྙེད་དང་བཀུར་སྟིས་ཟིལ་གྱིས་ནོན།
en: Will be under the power of gain and honor,

source: །གཅིག་ལ་གཅིག་ཀྱང་སྨོད་པར་བྱེད།
en: And they will criticize each other. {27}

source: །དགེ་སློང་དབང་པོ་མ་བསྡམས་པ།
en: “Many bhikṣus with unrestrained senses,

source: །གཞན་གྱི་བུད་མེད་རབ་སྙེགས་ཤིང་།
en: Who covet the wives of others,

source: །ཚུལ་ཁྲིམས་འཆལ་པ་རྙེད་པ་འདོད།
en: Who wish for gain and have poor conduct,

source: །མདོ་སྡེ་འདི་ལ་དད་མི་བྱེད།
en: Will have no faith in this sūtra. {28}

source: །སངས་རྒྱས་བརྙེས་པའི་བསོད་ནམས་དང་། །བསམ་གཏན་ཐོབ་པར་མི་འདོད་ཅིང་།
en: “Those who do not intend to attain Merit for buddhahood or to attain dhyāna,

source: །བདག་ཏུ་འདུ་ཤེས་གནས་པ་དག །མདོ་སྡེ་འདི་ལ་དད་མི་བྱེད།
en: And who maintain the conception of a self, Will have no faith in this sūtra. {29}

source: །ཕྱི་མའི་དུས་ན་འབྱུང་བ་ནི།
en: “In future times there will be those

source: །འཇིག་རྟེན་བསམ་གཏན་འབྲས་བུར་འཛིན།
en: Who are intent on the result of worldly dhyānas.

source: །དགྲ་བཅོམ་བསོད་སྙོམས་ཟོས་ནས་ཀྱང་། །སངས་རྒྱས་བྱང་ཆུབ་སྨོད་པར་བྱེད།
en: They will eat the alms food of arhats And criticize the enlightenment of buddhahood. {30} “One who rejects this sūtra Will have greater bad karma Than someone who destroys

source: །འཛམ་བུ་ཡི་ནི་གླིང་འདི་ནི། །མཆོད་རྟེན་ཅི་ཡོད་ཀུན་བཤིག་པས།
en: All the caityas in this Jambudvīpa. {31}

source: །གང་གིས་མདོ་སྡེ་འདི་སྤངས་ན།
en: “One who rejects this sūtra

source: །སྡིག་པ་འདི་ནི་ཁྱད་པར་ཆེ།
en: Will have greater bad karma

source: །གང་གིས་གང་གཱའི་བྱེ་སྙེད་ཀྱི། །དགྲ་བཅོམ་དག་ནི་བསད་པ་བས།
en: Than someone who kills as many arhats As there are grains of sand in the Ganges. {32}

source: །མི་བཟད་པ་ཡི་ཕྱི་དུས་ལ།
en: In the dreadful future time

source: །དམ་པའི་ཆོས་ནི་འཇིག་པའི་ཚེ། །མདོ་སྡེ་འདི་ནི་རབ་བཤད་པར། །ཁྱེད་ལ་སུ་དག་སྤྲོ་བ་ཡོད།
en: When the Dharma is ruined?” {33}

source: །དེ་ཚེ་གཞོན་ནུ་ལངས་ནས་ནི།
en: The young man stood up, weeping,

source: །ངུ་ཞིང་རྒྱལ་ལ་འདི་སྐད་གསོལ།
en: And at that time spoke to the Jina.

source: །སངས་རྒྱས་ཐུགས་ཀྱི་སྲས་པོ་ཡིས།
en: This heart-born son of the Buddha

source: །འདི་སྐད་སེང་གེའི་སྒྲ་ཡང་བསྒྲགས། །རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་འདས།
en: Roared thus this lion’s roar: {34}

source: །ལུས་དང་སྲོག་ཀྱང་རབ་བཏང་སྟེ།
en: Without concern for my life or body

source: །བདག་གིས་མདོ་སྡེ་རྒྱས་པར་བགྱི། །བྱིས་པ་རྣམས་ཀྱི་མི་བདེན་པ།
en: I will spread this sūtra widely. {35}

source: །བརྒྱད་ཅིང་སྤྱོས་པ་བཟོད་པར་བགྱི།
en: “I will endure

source: །གཤེ་བ་དང་ནི་བསྡིགས་པ་ཡང་།
en: The false talk of fools

source: །འདྲེན་པ་དང་དུ་བླང་བར་བགྱི། །བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ལ།
en: And, Guide, I will undergo

source: །ངན་སེམས་དག་ནི་བསྐྱེད་པ་འམ།
en: Their abuse and threats. {36}

source: །གང་སྔོན་བདག་གིས་སྡིག་པ་ཡི། །ལས་རྣམས་བགྱིས་པ་བྱང་བར་བགྱི།
en: “I shall cleanse myself of whatever bad actions I have done in the past And any maliciousness

source: །སྤྱི་བོ་ལ་ནི་ཕྱག་བཞག་སྟེ།
en: Toward other bodhisattvas.” {37}

source: །སངས་རྒྱས་གསེར་གྱི་མདོག་འདྲ་བ།
en: The Buddha, who was the color of gold, Placed his hand upon Candraprabha’s head.

source: །དེ་བཞིན་གཤེགས་པ་འཇམ་པའི་དབྱངས།
en: The Tathāgata, who had a gentle voice,

source: །ཟླ་འོད་ལ་ནི་སྟོན་པ་གསུང་།
en: The Teacher, then said to him, {38} “I give you my blessing.

source: །གཞོན་ནུ་ཕྱི་མའི་དུས་དག་ལ།
en: Young man, in the future

source: །ཁྱོད་ཀྱིས་ཚངས་པར་སྤྱོད་པ་དང་། །སྲོག་གི་བར་ཆད་མི་འབྱུང་བར།
en: There will be no obstacle to your celibacy

source: །ཁྱོད་ལ་བྱིན་གྱིས་བརླབ་པར་བྱ།
en: Nor will there be to your life.” {39}

source: །ཆོས་སྨྲ་བ་ནི་གཞན་དག་ཀྱང་།
en: Eight hundred dharmabhāṇakas

source: །བརྒྱད་བརྒྱ་པོ་དག་ལངས་ནས་ནི།
en: Who were present stood up and said,

source: །ཕྱི་མའི་དུས་ལ་བདག་ཅག་ཀྱང་།
en: “In future times we also

source: །མདོ་སྡེ་འདི་ནི་འཛིན་པ་ལགས།
en: Will be holders of this sūtra.” {40}

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་ཡང་། །བྱེ་བ་བརྒྱད་ཅུ་ཉེར་ལྷགས་ཏེ།
en: Eight hundred million Devas, nāgas, and yakṣas stood up,

source: །གཞན་ཡང་ཁྲག་ཁྲིག་དྲུག་ཅུ་རྣམས།
en: And another six trillion,

source: །འཇིག་རྟེན་མགོན་ལ་འདི་སྐད་སྨྲ།
en: And said to the guide of the world, {41} “Guide, in future times We will protect

source: །དགེ་སློང་དག་ནི་འདི་རྣམས་ལས། །དེ་རིང་སུ་དག་ལངས་པ་རྣམས། །ཕྱི་དུས་དེ་ཚེ་བདག་ཅག་གིས། །འདྲེན་པ་རབ་ཏུ་བསྲུང་བར་བགྱི།
en: These bhikṣus who Stood up today.” {42}

source: །མདོ་སྡེ་འདི་ནི་བཤད་པའི་ཚེ།
en: When this sūtra was taught,

source: །སྟོན་པ་ཡི་ནི་བྱིན་རླབས་ཀྱིས། །གང་གཱའི་བྱེ་མ་མཉམ་པ་ཡི།
en: Through the blessing of the Teacher,

source: །སངས་རྒྱས་ཞིང་རྣམས་རབ་ཏུ་གཡོས།
en: Buddha realms shook, in numbers Equal to the Ganges sands. {43} The Lord of the World sent

source: །ཞིང་རྣམས་ཇི་སྙེད་རབ་གཡོས་པས། །ཀུན་ཏུ་སངས་རྒྱས་སྤྲུལ་པ་དག །
en: To all those shaken buddha realms

source: འཇིག་རྟེན་མགོན་པོས་རབ་བཀྱེ་སྟེ།
en: Emanations of the Buddha

source: །དེ་དག་གིས་ཀྱང་ཆོས་རབ་བསྟན།
en: Who taught the Dharma there. {44}

source: །ཞིང་དེ་སོ་སོ་རེ་རེར་ཡང་།
en: In each of those realms

source: །སེམས་ཅན་བྱེ་བ་བསམ་མི་ཁྱབ།
en: Countless millions of beings Were established in the wisdom of buddhahood

source: །དེ་ཚེ་དེ་འདྲའི་ཆོས་ཐོས་ནས། །སངས་རྒྱས་ཀྱི་ནི་ཡེ་ཤེས་བཀོད།
en: When they had heard that Dharma. {45}

source: །སངས་རྒྱས་ཀྱི་ཡང་ཞིང་འདི་ནས།
en: In those buddha realms

source: །སེམས་ཅན་བྱེ་བ་དགུ་བཅུ་རྣམས།
en: Nine hundred million devas

source: །བྱང་ཆུབ་ཀྱི་ནི་སེམས་བསྐྱེད་དེ།
en: Developed the aspiration to enlightenment

source: །སངས་རྒྱས་ལ་ཡང་མེ་ཏོག་འཐོར།
en: And scattered flowers on the Buddha. {46} The Lord of men prophesied that

source: །བསྐལ་པ་བྱེ་བ་བརྒྱད་ཅུ་ན།
en: After eight hundred million eons

source: །བསྐལ་པ་གཅིག་ལ་ཐམས་ཅད་ཀྱང་།
en: They would all, within the same eon,
